/***************************************************************************//**
  @file     App.h
  @brief    Aplicación de alto nivel
  @author   RAS-ITBA
 ******************************************************************************/

#ifndef _APP_H_
#define _APP_H_

/*******************************************************************************
 * FUNCTION PROTOTYPES WITH GLOBAL SCOPE
 ******************************************************************************/

/**
 * @brief Inicializar aplicación
*/
void initApplication();

/**
 * @brief Ejecutar aplicación (debe llamarse en un ciclo infinito)
*/
void runApplication();


/*******************************************************************************
 ******************************************************************************/

#endif // _APP_H_